    IDENTIFICATION DIVISION.
    PROGRAM-ID. YOUR-PROGRAM-NAME.
    ENVIRONMENT DIVISION.
    CONFIGURATION SECTION.
    INPUT-OUTPUT SECTION.

    DATA DIVISION.

    FILE SECTION.

    WORKING-STORAGE SECTION.
    01 EMPLOYEE PIC X(56).
    01 SALARY PIC 9(5)V9(2).
    01 INCREMENT PIC 9V99 VALUE 0.05.
    01 MONTH PIC 9(10)V9(2).
    01 N PIC 9(1).
    01 I PIC 9(1).
    PROCEDURE DIVISION.
    START.
       DISPLAY "ENTER THE NUMBER OF EMPLOYEES".
       ACCEPT N.
       PERFORM PAYROLL VARYING I FROM 1 BY 1 UNTIL I > N.
       STOP RUN.

    PAYROLL.
        DISPLAY "ENTER THE EMPLOYEE NAME".
        ACCEPT EMPLOYEE.
        DISPLAY "ENTER THE SALARY:".
        ACCEPT SALARY.
        COMPUTE MONTH = SALARY * INCREMENT.
        DISPLAY "EMPLOYEE: " EMPLOYEE.
        DISPLAY "SALARY: " MONTH.
