 IDENTIFICATION DIVISION.
 PROGRAM-ID. SumTwoNumbers.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM1 PIC 9(4) VALUE 0.
 01 NUM2 PIC 9(4) VALUE 0.
 01 SUM PIC 9(4) VALUE 0.
 PROCEDURE DIVISION.
 DISPLAY "Enter the first number: ".
 ACCEPT NUM1.
 DISPLAY "Enter the second number: ".
 ACCEPT NUM2.
 ADD NUM1 TO NUM2 GIVING SUM.
 DISPLAY "The sum is: " SUM.
 STOP RUN.
