IDENTIFICATION DIVISION.
PROGRAM-ID. EvenOdd.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(4) VALUE 0.
01 RESULT PIC X(10).
01 REMAINDER PIC 9 VALUE 0.
PROCEDURE DIVISION.
DISPLAY "Enter a number: ".
ACCEPT NUM.
DIVIDE NUM BY 2 GIVING REMAINDER REMAINDER.
IF REMAINDER = 0 THEN
    MOVE "Even" TO RESULT
ELSE
    MOVE "Odd" TO RESULT
END-IF.
DISPLAY "The number is: " RESULT.
STOP RUN.
