IDENTIFICATION DIVISION.
PROGRAM-ID. CelsiusToFahrenheit.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 CELSIUS PIC 9(3)V9(1) VALUE 0.
01 FAHRENHEIT PIC 9(3)V9(1) VALUE 0.
PROCEDURE DIVISION.
DISPLAY "Enter the temperature in degrees Celsius: ".
ACCEPT CELSIUS.
COMPUTE FAHRENHEIT = (9 / 5.0 * CELSIUS) + 32.
DISPLAY "The temperature in Fahrenheit is: " FAHRENHEIT.
STOP RUN.
