IDENTIFICATION DIVISION.
PROGRAM-ID. Factorial.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM PIC 9(2) VALUE 0.
01 FACTORIAL PIC 9(9) VALUE 1.
01 I PIC 9(2) VALUE 1.
PROCEDURE DIVISION.
DISPLAY "Enter a number: ".
ACCEPT NUM.
PERFORM CALCULATE-FACTORIAL
DISPLAY "The factorial of " NUM " is " FACTORIAL.
STOP RUN.
CALCULATE-FACTORIAL.
PERFORM VARYING I FROM 1 BY 1 UNTIL I > NUM
MULTIPLY I BY FACTORIAL GIVING FACTORIAL
END-PERFORM.
EXIT.
