 IDENTIFICATION DIVISION.
 PROGRAM-ID. SumDigits.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM PIC 9(10) VALUE 0.
 01 SUM PIC 9(10) VALUE 0.
 01 DIGIT PIC 9 VALUE 0.
 PROCEDURE DIVISION.
    DISPLAY "Enter a number: ".
    ACCEPT NUM.
    PERFORM CALCULATE-SUM
    DISPLAY "The sum of the digits is: " SUM.
    STOP RUN.
 CALCULATE-SUM.
    PERFORM UNTIL NUM = 0
         COMPUTE DIGIT = NUM MOD 10
         ADD DIGIT TO SUM
         DIVIDE NUM BY 10 GIVING NUM
    END-PERFORM.
    EXIT.
