 IDENTIFICATION DIVISION.
 PROGRAM-ID. Calculator.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NUM1 PIC 9(4)V9(2) VALUE 0.
 01 NUM2 PIC 9(4)V9(2) VALUE 0.
 01 RESULT PIC 9(4)V9(2) VALUE 0.
 01 OPERATION PIC X VALUE SPACE.
 PROCEDURE DIVISION.
 DISPLAY "Enter the first number: ".
 ACCEPT NUM1.
 DISPLAY "Enter the second number: ".
 ACCEPT NUM2.
 DISPLAY "Enter the operation (+, -, *, /): ".
 ACCEPT OPERATION.
 EVALUATE OPERATION
 WHEN '+'
 PERFORM ADDITION
 WHEN '-'
 PERFORM SUBTRACTION
 WHEN '*'
 PERFORM MULTIPLICATION
 WHEN '/'
 PERFORM DIVISION
 WHEN OTHER
 DISPLAY "Invalid operation"
 END-EVALUATE.
 DISPLAY "The result is: " RESULT.
 STOP RUN.
 ADDITION.
 ADD NUM1 TO NUM2 GIVING RESULT.
 EXIT.
 SUBTRACTION.
 SUBTRACT NUM2 FROM NUM1 GIVING RESULT.
 EXIT.
 MULTIPLICATION.
 MULTIPLY NUM1 BY NUM2 GIVING RESULT.
 EXIT.
 DIVISION.
 IF NUM2 = 0 THEN
 DISPLAY "Error: Division by zero."
 MOVE 0 TO RESULT
 ELSE
 DIVIDE NUM1 BY NUM2 GIVING RESULT
 END-IF.
 EXIT.
