IDENTIFICATION DIVISION.
PROGRAM-ID. ListNumbers.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 COUNTER PIC 9(2) VALUE 1.
PROCEDURE DIVISION.
    PERFORM UNTIL COUNTER > 10
        DISPLAY COUNTER
        ADD 1 TO COUNTER
    END-PERFORM.
    STOP RUN.
